#+TITLE: Documentation from API

*** Get users
#+begin_src restclient
GET http://localhost:3000/users
#+end_src

#+RESULTS:
#+begin_example
,#+BEGIN_SRC js
[
  {
    "id": 1,
    "email": "juan@gmail.com",
    "password": "juanforever",
    "role": "user"
  }
]
// GET http://localhost:3000/users
// HTTP/1.1 200 OK
// X-Powered-By: Express
// Content-Type: application/json; charset=utf-8
// Content-Length: 74
// ETag: W/"4a-t9+xHTiCTNMv9tvG9YovEFO1Lqs"
// Date: Fri, 01 Oct 2021 19:20:51 GMT
// Connection: keep-alive
// Keep-Alive: timeout=5
// Request duration: 0.133374s
,#+END_SRC
#+end_example

